the flow direction of this connector, In or Out.
  Namespace:   Autodesk.Revit.DB.Mechanical
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public FlowDirectionType FlowDirection { get; }
  Visual Basic
Public ReadOnly Property FlowDirection As FlowDirectionType
	Get
  Visual C++
public:
property FlowDirectionType FlowDirection {
	FlowDirectionType get ();
}
 See Also
  DuctFittingAndAccessoryConnectorData Class
  Autodesk.Revit.DB.Mechanical Namespace